package com.ai_l1;

public class Main {

    public static void main(String[] args) {

        int[][] graf ={
                {0,3,2,5,999,999,999,999,999},
                {3,0,4,8,5,999,999,999,999},
                {2,4,0,7,4,5,999,999,999},
                {5,8,7,0,4,4,7,999,9},
                {999,5,999,4,0,999,6,10,999},
                {999,999,3,4,999,0,1,999,8},
                {999,999,999,7,6,1,0,3,2},
                {999,999,999,999,10,999,3,0,10},
                {999,999,999,9,999,8,2,10,0}
        };

        int much=50; //кол-во хромосом
        int gens=9; //кол-во генов равно максимальной длине пути - кол-во элементов графа
        int mutation_chanse=15; //шанс мутации гена
        int pokolen=30; //кол-во поколений

        Gens gens1 = new Gens(graf, much, gens, mutation_chanse, pokolen);
        gens1.demonstrate();
    }
}
